Revit 2026 API
LayoutRuleFixedDistance Class
This class indicate the layout rule of a Beam System is Fixed-Distance.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.LayoutRule
 Autodesk.Revit.DB.LayoutRuleFixedDistance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class LayoutRuleFixedDistance : LayoutRule
Public Class LayoutRuleFixedDistance
	Inherits LayoutRule
public ref class LayoutRuleFixedDistance : public LayoutRule
type LayoutRuleFixedDistance =
    class
        inherit LayoutRule
    end
The LayoutRuleFixedDistance type exposes the following members.
Constructors
Name | Description
LayoutRuleFixedDistance | Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
Top
Properties
Name | Description
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
JustifyType | Get or set the type of justification.
Spacing | Get or set spacing of the Beam System.
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
To use this type of LayoutRule, the distance between the beams and the justify-type must be set.
See Also
Reference
Autodesk.Revit.DB Namespace